### Exploring Northwind database using SQL - Pivot and Unpivot

The Northwind database was originally created by Microsoft. It simulates a wholesale business called "Northwind Traders" that imports and exports foods worldwide.

In this exercise, I explore the Northwind database using Postgre SQL by Pivoting the tables.

In [1]:
#Import libraries
import pandas as pd
from sqlalchemy import create_engine, text

In [2]:
# Create database connection
engine = create_engine('postgresql+psycopg2://tharinduabeysinghe:####@localhost/northwind')

# Run quey and load data to a dataframe
def execute_sql_query(sql):
    # Load data into a pandas DataFrame
    df = pd.DataFrame()
    with engine.connect() as conn:
        df = pd.read_sql_query(text(sql), conn)
    return df

#### Pivot and UnPivot

Pivot and Unpivot are used to transform data (rotate from rows to columns and vice versa) and make more readable and efficient. This is crucial in summarizing, analyzing and reporting data. 

When we apply Pivot, each unique value in a column turned into its own column and data is aggregated based on a specific function such as sum, avg, or count. Unpivot is the reverse of Pivot. It converts columns back into rows.

Many pivot tasks in SQL can be completed using an aggregate functions with FILTER function. The FILTER() function lets you to compute multiple conditional aggregates in the same query. This is often the simplest and cleanest method to pivot a table. When we have dynamic and unknown categories or when we need to pivot dozens of values aggregate and FILTER() method is not enough. In that case we can use Pivot or Crosstab functions depending on the DBMS system we use. 

The code below queries the number of orders shipped to each region of the United States per year.

In [3]:
# Define the SQL query to count orders shipped to each US region per year
sql = '''
SELECT 
    EXTRACT(YEAR FROM order_date)::int AS order_year,
    COUNT(order_id) FILTER (WHERE ship_region = 'AK') AS orders_AK,
    COUNT(order_id) FILTER (WHERE ship_region = 'CA') AS orders_CA,
    COUNT(order_id) FILTER (WHERE ship_region = 'ID') AS orders_ID,
    COUNT(order_id) FILTER (WHERE ship_region = 'MT') AS orders_MT,
    COUNT(order_id) FILTER (WHERE ship_region = 'NM') AS orders_NM,
    COUNT(order_id) FILTER (WHERE ship_region = 'OR') AS orders_OR,
    COUNT(order_id) FILTER (WHERE ship_region = 'WA') AS orders_WA,
    COUNT(order_id) FILTER (WHERE ship_region = 'WY') AS orders_WY
FROM public.orders
WHERE ship_country = 'USA'
GROUP BY order_year
'''
        
# Execute query
execute_sql_query(sql)

,order_year,orders_ak,orders_ca,orders_id,orders_mt,orders_nm,orders_or,orders_wa,orders_wy
0,1997,4,3,17,2,6,14,12,2
1,1996,2,0,3,0,6,5,2,5
2,1998,4,1,11,1,6,9,5,2

The next query returns the annual sales (dollar amount) of each employee. Thought process behind the query is described below.

First, three tables are joined to get the following details
1. employees - employee names
2. orders - order date
3. order_details - quantity of sales, unit price of each food item, and discounts

employees and orders tables are joined employee_id column. The output is joined with order_details table using order_id column.

A pivot table is created to return the final output by the following order.
1. Filter the data by year.
2. Calculate the total dollar amounts of sales for each row.
3. Group total sales by each employee name.

In [4]:

sql = '''
WITH sales AS (
    SELECT 
        CONCAT(first_name, ' ', last_name) AS employee_name,
        EXTRACT(YEAR FROM o.order_date)::int AS order_year,
        d.quantity,
        d.unit_price,
        d.discount
    FROM employees e
    JOIN orders o ON o.employee_id = e.employee_id
    JOIN order_details d ON d.order_id = o.order_id
)
SELECT 
    employee_name,
    ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1996)::numeric, 2) AS sales_1996,
    ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1997)::numeric, 2) AS sales_1997,
    ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1998)::numeric, 2) AS sales_1998
FROM sales
GROUP BY employee_name
'''        
# Execute query
execute_sql_query(sql)

      employee_name  sales_1996  sales_1997  sales_1998
0       Robert King    15232.16    60471.19    48864.88
1     Nancy Davolio    35764.52    93148.08    63195.01
2    Laura Callahan    22240.12    56032.62    48589.54
3    Michael Suyama    16642.61    43126.37    14144.15
4     Andrew Fuller    21757.06    70444.14    74336.55
5   Steven Buchanan    18383.92    30716.47    19691.89
6   Janet Leverling    18223.96   108026.16    76562.73
7  Margaret Peacock    49945.12   128809.79    54135.94
8    Anne Dodsworth     9894.51    26310.39    41103.16

We can rearrange this table by unpivoting it to a table with the column names: employee_name, year, and sales. The unpivot can be done using LATERAL keyword. 

LATERAL works like a loop, where for each row in the outer query, the lateral subquery runs and use that row's value. This allows a subquery in the FROM clause to reference columns from preceding tables in the same FROM clause, which is normally not allowed. Similar to loops, LATERAL is computationally inefficient.

In [5]:
sql = '''
WITH sales AS (
    SELECT 
        CONCAT(first_name, ' ', last_name) AS employee_name,
        EXTRACT(YEAR FROM o.order_date)::int AS order_year,
        d.quantity,
        d.unit_price,
        d.discount
    FROM employees e
    JOIN orders o ON o.employee_id = e.employee_id
    JOIN order_details d ON d.order_id = o.order_id
),
yearly_sales AS (
    -- Create pivot table with yearly sales for each employee
    SELECT 
        employee_name,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1996)::numeric, 2) AS sales_1996,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1997)::numeric, 2) AS sales_1997,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1998)::numeric, 2) AS sales_1998
    FROM sales
    GROUP BY employee_name
)
-- Unpivot the yearly sales data
SELECT 
    employee_name,
    v.year,
    v.sales
FROM yearly_sales ys,
LATERAL (
    VALUES
        ('1996', ys.sales_1996),
        ('1997', ys.sales_1997),
        ('1998', ys.sales_1998)
) AS v(year, sales)
ORDER BY employee_name, v.year;
'''

# Execute query
execute_sql_query(sql)

       employee_name  year      sales
0      Andrew Fuller  1996   21757.06
1      Andrew Fuller  1997   70444.14
2      Andrew Fuller  1998   74336.55
3     Anne Dodsworth  1996    9894.51
4     Anne Dodsworth  1997   26310.39
5     Anne Dodsworth  1998   41103.16
6    Janet Leverling  1996   18223.96
7    Janet Leverling  1997  108026.16
8    Janet Leverling  1998   76562.73
9     Laura Callahan  1996   22240.12
10    Laura Callahan  1997   56032.62
11    Laura Callahan  1998   48589.54
12  Margaret Peacock  1996   49945.12
13  Margaret Peacock  1997  128809.79
14  Margaret Peacock  1998   54135.94
15    Michael Suyama  1996   16642.61
16    Michael Suyama  1997   43126.37
17    Michael Suyama  1998   14144.15
18     Nancy Davolio  1996   35764.52
19     Nancy Davolio  1997   93148.08
20     Nancy Davolio  1998   63195.01
21       Robert King  1996   15232.16
22       Robert King  1997   60471.19
23       Robert King  1998   48864.88
24   Steven Buchanan  1996   18383.92
25   Steven Buchanan  1997   30716.47
26   Steven Buchanan  1998   19691.89

There are two other ways to do this unpivot. First method is using a UNION ALL as below.

In [6]:
sql = '''
WITH sales AS (
    SELECT 
        CONCAT(first_name, ' ', last_name) AS employee_name,
        EXTRACT(YEAR FROM o.order_date)::int AS order_year,
        d.quantity,
        d.unit_price,
        d.discount
    FROM employees e
    JOIN orders o ON o.employee_id = e.employee_id
    JOIN order_details d ON d.order_id = o.order_id
),
yearly_sales AS (
    -- Create pivot table with yearly sales for each employee
    SELECT 
        employee_name,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1996)::numeric, 2) AS sales_1996,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1997)::numeric, 2) AS sales_1997,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1998)::numeric, 2) AS sales_1998
    FROM sales
    GROUP BY employee_name
)
-- Unpivot the yearly sales data using UNION ALL
SELECT 
    employee_name,
    '1996' AS year, 
    sales_1996 AS sales
FROM yearly_sales
UNION ALL
SELECT 
    employee_name,
    '1997' AS year, 
    sales_1997 AS sales
FROM yearly_sales
UNION ALL 
SELECT 
    employee_name,
    '1998' AS year, 
    sales_1998 AS sales
FROM yearly_sales;
'''

# Execute query
execute_sql_query(sql)

       employee_name  year      sales
0        Robert King  1996   15232.16
1      Nancy Davolio  1996   35764.52
2     Laura Callahan  1996   22240.12
3     Michael Suyama  1996   16642.61
4      Andrew Fuller  1996   21757.06
5    Steven Buchanan  1996   18383.92
6    Janet Leverling  1996   18223.96
7   Margaret Peacock  1996   49945.12
8     Anne Dodsworth  1996    9894.51
9        Robert King  1997   60471.19
10     Nancy Davolio  1997   93148.08
11    Laura Callahan  1997   56032.62
12    Michael Suyama  1997   43126.37
13     Andrew Fuller  1997   70444.14
14   Steven Buchanan  1997   30716.47
15   Janet Leverling  1997  108026.16
16  Margaret Peacock  1997  128809.79
17    Anne Dodsworth  1997   26310.39
18       Robert King  1998   48864.88
19     Nancy Davolio  1998   63195.01
20    Laura Callahan  1998   48589.54
21    Michael Suyama  1998   14144.15
22     Andrew Fuller  1998   74336.55
23   Steven Buchanan  1998   19691.89
24   Janet Leverling  1998   76562.73
25  Margaret Peacock  1998   54135.94
26    Anne Dodsworth  1998   41103.16

The third method is using a procedural script. This method can be faster than using LATERAL specially when working with large datasets.

Two Temp Tables are created in intermediate steps. Temp Tables are dropped automatically once the session is closed. The first Temp Table is the input for the Procedural script. 

The procedural script iteratively run over each column of the pivot table and unpivots it. In each iteration, year value is extracted from column names and added to the year column, then the values of the corresponding column is added to the next column named sales.

Once the loop is completed, the unpivoted data is inserted to the second Temp Table and the data type of the year column is converted from text to integer.

In [7]:
sql = '''
CREATE TEMP TABLE yearly_sales AS
WITH sales AS (
    SELECT 
        CONCAT(first_name, ' ', last_name) AS employee_name,
        EXTRACT(YEAR FROM o.order_date)::int AS order_year,
        d.quantity,
        d.unit_price,
        d.discount
    FROM employees e
    JOIN orders o ON o.employee_id = e.employee_id
    JOIN order_details d ON d.order_id = o.order_id
),
yearly_sales_cte AS (
    SELECT 
        employee_name,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1996)::numeric, 2) AS sales_1996,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1997)::numeric, 2) AS sales_1997,
        ROUND(SUM(quantity * unit_price * (1 - discount)) FILTER (WHERE order_year = 1998)::numeric, 2) AS sales_1998
    FROM sales
    GROUP BY employee_name
)
SELECT * FROM yearly_sales_cte;

-- Create a temp table to insert the unpivoted data
CREATE TEMP TABLE unpivoted_sales (
    employee_name TEXT,
    year TEXT,
    sales NUMERIC
);

-- Procedure to unpivot the table
DO $$
DECLARE
    col TEXT;
    year TEXT;
    sql TEXT := '';
    cols TEXT[] := ARRAY['sales_1996', 'sales_1997', 'sales_1998'];
BEGIN
    FOREACH col IN ARRAY cols LOOP
        -- Extract year from column names
        year := split_part(col, '_', 2);

        sql := sql || format(
            'SELECT employee_name, %L AS year, %I AS sales FROM yearly_sales UNION ALL ',
            year, col
        );
    END LOOP;

    -- Remove trailing "UNION ALL"
    sql := left(sql, length(sql) - 11);

    -- Insert the result into the table
    EXECUTE 'INSERT INTO unpivoted_sales ' || sql;

    -- Update data type of the year column
    ALTER TABLE unpivoted_sales
    ALTER COLUMN year TYPE INTEGER USING year::INT;
END $$;

SELECT * FROM unpivoted_sales ORDER BY employee_name, year;
'''

# Execute query
execute_sql_query(sql)

       employee_name  year      sales
0      Andrew Fuller  1996   21757.06
1      Andrew Fuller  1997   70444.14
2      Andrew Fuller  1998   74336.55
3     Anne Dodsworth  1996    9894.51
4     Anne Dodsworth  1997   26310.39
5     Anne Dodsworth  1998   41103.16
6    Janet Leverling  1996   18223.96
7    Janet Leverling  1997  108026.16
8    Janet Leverling  1998   76562.73
9     Laura Callahan  1996   22240.12
10    Laura Callahan  1997   56032.62
11    Laura Callahan  1998   48589.54
12  Margaret Peacock  1996   49945.12
13  Margaret Peacock  1997  128809.79
14  Margaret Peacock  1998   54135.94
15    Michael Suyama  1996   16642.61
16    Michael Suyama  1997   43126.37
17    Michael Suyama  1998   14144.15
18     Nancy Davolio  1996   35764.52
19     Nancy Davolio  1997   93148.08
20     Nancy Davolio  1998   63195.01
21       Robert King  1996   15232.16
22       Robert King  1997   60471.19
23       Robert King  1998   48864.88
24   Steven Buchanan  1996   18383.92
25   Steven Buchanan  1997   30716.47
26   Steven Buchanan  1998   19691.89

Another Pivot method:
Create a pivot table to list products under each category column

In the first step, we create a CTE with category and product names. Since we need to have columns with category names, a window function is used. The CTE is partitioned by category and added the row number under each category to a new column called rn. 

In the second step, the CTE is grouped by the rn first. Then we use a condition: when the category name is Beverages in the grouped rows, then select the product name into the new column called Beverages. The MAX function is used to assign the selected product name to the new Beverage column. This step is repeated for all the categories in all row groups in the CTE to get the final output.

In [9]:
sql = '''
WITH category_product AS (
SELECT
        category_name,
        product_name,
		ROW_NUMBER() OVER(PARTITION BY category_name) AS rn
FROM categories c
JOIN products p
ON c.category_id = p.category_id
ORDER BY category_name
)

SELECT
    MAX(CASE WHEN category_name = 'Beverages' THEN product_name END) AS Beverages,
    MAX(CASE WHEN category_name = 'Condiments' THEN product_name END) AS Condiments,
	MAX(CASE WHEN category_name = 'Confections' THEN product_name END) AS Confections,
	MAX(CASE WHEN category_name = 'Dairy Products' THEN product_name END) AS Dairy_Products,
    MAX(CASE WHEN category_name = 'Grains/Cereals' THEN product_name END) AS Grains_Cereals,
	MAX(CASE WHEN category_name = 'Meat/Poultry' THEN product_name END) AS Meat_Poultry,
    MAX(CASE WHEN category_name = 'Produce' THEN product_name END) AS Produce,
	MAX(CASE WHEN category_name = 'Seafood' THEN product_name END) AS Seafood
FROM category_product
GROUP BY rn
ORDER BY rn
'''
#Execute query
execute_sql_query(sql)

,beverages,condiments,confections,dairy_products,grains_cereals,meat_poultry,produce,seafood
0,Guaran Fantstica,Gula Malacca,Scottish Longbreads,Gudbrandsdalsost,Gnocchi di nonna Alice,Alice Mutton,Manjimup Dried Apples,Gravad lax
1,Ipoh Coffee,Original Frankfurter grne Soe,Pavlova,Camembert Pierrot,Ravioli Angelo,Mishi Kobe Niku,Uncle Bob's Organic Dried Pears,Boston Crab Meat
2,Chartreuse verte,Northwoods Cranberry Sauce,Teatime Chocolate Biscuits,Mozzarella di Giovanni,Gustaf's Knckebrd,Perth Pasties,Longlife Tofu,Jack's New England Clam Chowder
3,Cte de Blaye,Louisiana Hot Spiced Okra,Sir Rodney's Marmalade,Geitost,Filo Mix,Tourtire,Rssle Sauerkraut,Rogede sild
4,Steeleye Stout,Genen Shouyu,Sir Rodney's Scones,Mascarpone Fabioli,Singaporean Hokkien Fried Mee,Pt chinois,Tofu,Spegesild
5,Sasquatch Ale,Grandma's Boysenberry Spread,NuNuCa Nu-Nougat-Creme,Gorgonzola Telino,Tunnbrd,Thringer Rostbratwurst,None,Rd Kaviar
6,Lakkalikri,Louisiana Fiery Hot Pepper Sauce,Gumbr Gummibrchen,Queso Manchego La Pastora,Wimmers gute Semmelkndel,None,None,Ikura
7,Rhnbru Klosterbier,Vegie-spread,Schoggi Schokolade,Queso Cabrales,None,None,None,Escargots de Bourgogne
8,Outback Lager,Aniseed Syrup,Zaanse koeken,Flotemysost,None,None,None,Carnarvon Tigers
9,Chai,Chef Anton's Cajun Seasoning,Chocolade,Raclette Courdavault,None,None,None,Konbu
10,Laughing Lumberjack Lager,Chef Anton's Gumbo Mix,Maxilaku,None,None,None,None,Inlagd Sill
11,Chang,Sirop d'rable,Valkoinen suklaa,None,None,None,None,Nord-Ost Matjeshering
12,None,None,Tarte au sucre,None,None,None,None,None